Tekla Open API Reference for Tekla Structures 2025
HyperLink Class
 The HyperLink class defines a hyperlink object in a drawing. When a hyperlink is double clicked, the default browser is launched.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.LinkBase
 Tekla.Structures.Drawing.HyperLink
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class HyperLink : LinkBase
<SerializableAttribute>
Public NotInheritable Class HyperLink
	Inherits LinkBase
The HyperLink type exposes the following members.
Constructors
Name | Description
HyperLink(ViewBase, Point, Uri, String)
 Creates a new hyperlink instance using standard attributes.
HyperLink(ViewBase, Point, Uri, String, LinkAttributes)
 Creates a new hyperlink instance using the given attributes.
HyperLink(ViewBase, Point, Uri, String, Size)
 Creates a new hyperlink instance using standard attributes.
HyperLink(ViewBase, Point, Uri, String, Size, LinkAttributes)
 Creates a new hyperlink instance using the given attributes.
Top
Properties
Name | Description
Angle
 Gets or sets the angle of the link.
 (Inherited from LinkBase.)
Attributes
 Gets or sets the link attributes.
 (Inherited from LinkBase.)
InsertionPoint
 Gets or sets the insertion point of the link.
 (Inherited from LinkBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Target
 Gets or sets the target.
Text
 Gets or sets the link text that is visible on the screen.
 (Inherited from LinkBase.)
Top
Methods
Name | Description
Delete
 Deletes the link.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Gets the bounding box for the current object in the global axis coordinate system.
 (Inherited from LinkBase.)
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDrawing
 Gets the drawing where the drawing object is.
 (Inherited from DrawingObject.)
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetObjectAlignedBoundingBox
 Gets the bounding box for the current object in its local coordinate system.
 (Inherited from LinkBase.)
GetRelatedObjects()
 Gets the related objects of the current object.
 (Inherited from DrawingObject.)
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
 (Inherited from DrawingObject.)
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetView
 Gets the view where the drawing object is.
 (Inherited from DrawingObject.)
Insert
 Inserts the link.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Inherited from DatabaseObject.)
Modify
 Modifies the link.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object according to the given move vector.
 (Inherited from LinkBase.)
Resize
 Resizes the object. The scaling type is changed to ScaleToFit.
 (Inherited from LinkBase.)
Select
 Selects the link.
 (Overrides DatabaseObject.Select().)
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
ToString
 Changes the string presentation of the drawing object.
 (Inherited from DrawingObject.)
Top
Examples
 The following example shows how to insert a hyperlink:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           ViewBase _view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
           HyperLink link = new HyperLink(_view, new Point(200, 200),
               new Uri("http://www.tekla.com"),
               "Link to Tekla home page");
           link.Insert();
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace